In [11]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [12]:
%sql sqlite:///movies.db

'Connected: @movies.db'

In [17]:
%%sql

DELETE FROM screenings;
DELETE FROM tickets;

INSERT INTO screenings (screening_time, screening_date, production_year, movie_name, theater_name)
VALUES  ('19:00:00', '19-02-22', 2017, "The Shape of Water", "Kino"),
        ('19:00:00', '19-02-23', 2016, "Moonlight", "Skandia");

INSERT INTO tickets(user_name, screening_time, screening_date, theater_name)
VALUES  ("alice", '19:00:00', '19-02-22', "Kino"),
        ("alice", '19:00:00', '19-02-22', "Kino"),
        ("alice", '19:00:00', '19-02-23', "Skandia");

SELECT screening_id, screening_date, screening_time, theater_name, movie_name, production_year, count()
FROM tickets
LEFT OUTER JOIN screenings
USING (screening_time, screening_date, theater_name)
WHERE user_name = "alice"
GROUP BY screening_id

 * sqlite:///movies.db
2 rows affected.
3 rows affected.
2 rows affected.
3 rows affected.
Done.

[('6f1aecd24477f87de52e960c040a475c', '19-02-23', '19:00:00', 'Skandia', 'Moonlight', 2016, 1),
 ('f687173152b19c5b2e419991c6fe0b21', '19-02-22', '19:00:00', 'Kino', 'The Shape of Water', 2017, 2)]